{"class_name": "Sequential", "keras_version": "1.0.7", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 32, 30], "U_regularizer": null, "dropout_U": 0.0, "unroll": false, "inner_activation": "hard_sigmoid", "go_backwards": false, "input_dtype": "float32", "init": "glorot_uniform", "activation": "tanh", "inner_init": "orthogonal", "input_dim": 30, "trainable": true, "forget_bias_init": "one", "name": "lstm_1", "input_length": null, "W_regularizer": null, "output_dim": 512, "dropout_W": 0.0, "stateful": false, "b_regularizer": null, "consume_less": "cpu", "return_sequences": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "LSTM", "config": {"trainable": true, "forget_bias_init": "one", "name": "lstm_2", "U_regularizer": null, "init": "glorot_uniform", "unroll": false, "input_length": null, "W_regularizer": null, "inner_activation": "hard_sigmoid", "go_backwards": false, "input_dim": 512, "stateful": false, "dropout_W": 0.0, "dropout_U": 0.0, "activation": "tanh", "inner_init": "orthogonal", "output_dim": 512, "b_regularizer": null, "consume_less": "cpu", "return_sequences": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.4}}, {"class_name": "LSTM", "config": {"trainable": true, "forget_bias_init": "one", "name": "lstm_3", "U_regularizer": null, "init": "glorot_uniform", "unroll": false, "input_length": null, "W_regularizer": null, "inner_activation": "hard_sigmoid", "go_backwards": false, "input_dim": 512, "stateful": false, "dropout_W": 0.0, "dropout_U": 0.0, "activation": "tanh", "inner_init": "orthogonal", "output_dim": 512, "b_regularizer": null, "consume_less": "cpu", "return_sequences": false}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.2}}, {"class_name": "Dense", "config": {"name": "dense_1", "W_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "output_dim": 2, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "input_dim": null, "b_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}]}