{"keras_version": "1.0.7", "config": [{"class_name": "LSTM", "config": {"init": "glorot_uniform", "input_dtype": "float32", "batch_input_shape": [null, 32, 30], "dropout_W": 0.0, "name": "lstm_1", "input_dim": 30, "return_sequences": true, "input_length": null, "trainable": true, "go_backwards": false, "inner_init": "orthogonal", "stateful": false, "b_regularizer": null, "activation": "tanh", "forget_bias_init": "one", "W_regularizer": null, "unroll": false, "inner_activation": "hard_sigmoid", "dropout_U": 0.0, "U_regularizer": null, "consume_less": "cpu", "output_dim": 512}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "LSTM", "config": {"inner_activation": "hard_sigmoid", "activation": "tanh", "name": "lstm_2", "W_regularizer": null, "unroll": false, "init": "glorot_uniform", "trainable": true, "dropout_W": 0.0, "forget_bias_init": "one", "input_dim": 512, "stateful": false, "return_sequences": true, "U_regularizer": null, "input_length": null, "go_backwards": false, "b_regularizer": null, "output_dim": 512, "inner_init": "orthogonal", "dropout_U": 0.0, "consume_less": "cpu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.4}}, {"class_name": "LSTM", "config": {"inner_activation": "hard_sigmoid", "activation": "tanh", "name": "lstm_3", "W_regularizer": null, "unroll": false, "init": "glorot_uniform", "trainable": true, "dropout_W": 0.0, "forget_bias_init": "one", "input_dim": 512, "stateful": false, "return_sequences": false, "U_regularizer": null, "input_length": null, "go_backwards": false, "b_regularizer": null, "output_dim": 512, "inner_init": "orthogonal", "dropout_U": 0.0, "consume_less": "cpu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.2}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_1", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "output_dim": 2, "input_dim": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_1"}}], "class_name": "Sequential"}